IDEA Open Model
SteelSetupRUS Class
 Steel setup RUS class
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.SteelSetup
 IdeaRS.OpenModel.SteelSetupRUS
 Namespace: IdeaRS.OpenModel
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.0.1.1 (10.0.1.1)
Syntax
public class SteelSetupRUS : SteelSetup
Public Class SteelSetupRUS
	Inherits SteelSetup
public ref class SteelSetupRUS : public SteelSetup
The SteelSetupRUS type exposes the following members.
Constructors
Name | Description
SteelSetupRUS
Initializes a new instance of the SteelSetupRUS class
Top
Properties
Name | Description
Anchor_Fiar
 Safety factor Anchor_Fiar
Bolt_Fib
 Safety factor Bolt_Fib
Bolt_Fip
 Safety factor preloaded bolt
CrtBearing
 Concrete bearing factor
Structural_Fi
 Safety factor Structural_Fi
Weld_Fiw
 Safety factor Weld_Fiw
Top
See Also
Reference
IdeaRS.OpenModel Namespace